Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/DWT_356.0.xml
<module id="DWT" HW_revision="356.0">
    <register id="DWT_CTRL" width="32" offset="0x0" internal="0" description="DWT Control Register">
        <bitfield id="CYCCNTENA" description="Enable the CYCCNT counter. If not enabled, the counter does not count and no event is generated for PS sampling or CYCCNTENA. In normal use, the debugger must initialize the CYCCNT counter to 0." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="POSTPRESET" description="Reload value for POSTCNT, bits [8:5], post-scalar counter. If this value is 0, events are triggered on each tap change (a power of 2). If this field has a non-0 value, this forms a count-down value, to be reloaded into POSTCNT each time it reaches 0. For example, a value 1 in this register means an event is formed every other tap change." begin="4" end="1" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="POSTCNT" description="Post-scalar counter for CYCTAP. When the selected tapped bit changes from 0 to 1 or 1 to 0, the post scalar counter is down-counted when not 0. If 0, it triggers an event for PCSAMPLENA or CYCEVTENA use. It also reloads with the value from POSTPRESET (bits [4:1])." begin="8" end="5" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="CYCTAP" description="Selects a tap on the DWT_CYCCNT register. These are spaced at bits [6] and [10]. When the selected bit in the CYCCNT register changes from 0 to 1 or 1 to 0, it emits into the POSTCNT, bits [8:5], post-scalar counter. That counter then counts down. On a bit change when post-scalar is 0, it triggers an event for PC sampling or CYCEVTCNT." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="selects bit [6] to tap"/>
            <bitenum id="en_0b1" value="0x1" description="selects bit [10] to tap."/>
        </bitfield>
        <bitfield id="SYNCTAP" description="Feeds a synchronization pulse to the ITM SYNCENA control. The value selected here picks the rate (approximately 1/second or less) by selecting a tap on the DWT_CYCCNT register. To use synchronization (heartbeat and hot-connect synchronization), CYCCNTENA must be set to 1, SYNCTAP must be set to one of its values, and SYNCENA must be set to 1." begin="11" end="10" width="2" rwaccess="R/W">
            <bitenum id="en_0b00" value="0x0" description="Disabled. No synch counting."/>
            <bitenum id="en_0b01" value="0x1" description="Tap at CYCCNT bit 24."/>
            <bitenum id="en_0b10" value="0x2" description="Tap at CYCCNT bit 26."/>
            <bitenum id="en_0b11" value="0x3" description="Tap at CYCCNT bit 28."/>
        </bitfield>
        <bitfield id="PCSAMPLEENA" description="Enables PC Sampling event. A PC sample event is emitted when the POSTCNT counter triggers it. See CYCTAP, bit [9], and POSTPRESET, bits [4:1], for details. Enabling this bit overrides CYCEVTENA (bit [20]). Reset clears the PCSAMPLENA bit." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="PC Sampling event disabled."/>
            <bitenum id="en_0b1" value="0x1" description="Sampling event enabled."/>
        </bitfield>
        <bitfield id="EXCTRCENA" description="Enables Interrupt event tracing. Reset clears the EXCEVTENA bit." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="interrupt event trace disabled."/>
            <bitenum id="en_0b1" value="0x1" description="interrupt event trace enabled."/>
        </bitfield>
        <bitfield id="CPIEVTENA" description="Enables CPI count event. Emits an event when DWT_CPICNT overflows (every 256 cycles of multi-cycle instructions). Reset clears the CPIEVTENA bit." begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="CPI counter events disabled."/>
            <bitenum id="en_0b1" value="0x1" description="CPI counter events enabled."/>
        </bitfield>
        <bitfield id="EXCEVTENA" description="Enables Interrupt overhead event. Emits an event when DWT_EXCCNT overflows (every 256 cycles of interrupt overhead). Reset clears the EXCEVTENA bit." begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="Interrupt overhead event disabled."/>
            <bitenum id="en_0b1" value="0x1" description="Interrupt overhead event enabled."/>
        </bitfield>
        <bitfield id="SLEEPEVTENA" description="Enables Sleep count event. Emits an event when DWT_SLEEPCNT overflows (every 256 cycles that the processor is sleeping). Reset clears the SLEEPEVTENA bit." begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="Sleep count events disabled."/>
            <bitenum id="en_0b1" value="0x1" description="Sleep count events enabled."/>
        </bitfield>
        <bitfield id="LSUEVTENA" description="Enables LSU count event. Emits an event when DWT_LSUCNT overflows (every 256 cycles of LSU operation). LSU counts include all LSU costs after the initial cycle for the instruction. Reset clears the LSUEVTENA bit." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="LSU count events disabled."/>
            <bitenum id="en_0b1" value="0x1" description="LSU count events enabled."/>
        </bitfield>
        <bitfield id="FOLDEVTENA" description="Enables Folded instruction count event. Emits an event when DWT_FOLDCNT overflows (every 256 cycles of folded instructions). A folded instruction is one that does not incur even one cycle to execute. For example, an IT instruction is folded away and so does not use up one cycle. Reset clears the FOLDEVTENA bit." begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="Folded instruction count events disabled."/>
            <bitenum id="en_0b1" value="0x1" description="Folded instruction count events enabled."/>
        </bitfield>
        <bitfield id="CYCEVTENA" description="Enables Cycle count event. Emits an event when the POSTCNT counter triggers it. See CYCTAP (bit [9]) and POSTPRESET, bits [4:1], for details. This event is only emitted if PCSAMPLENA, bit [12], is disabled. PCSAMPLENA overrides the setting of this bit. Reset clears the CYCEVTENA bit." begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="en_0b0" value="0x0" description="Cycle count events disabled."/>
            <bitenum id="en_0b1" value="0x1" description="Cycle count events enabled."/>
        </bitfield>
        <bitfield id="NOPRFCNT" description="When set, DWT_FOLDCNT, DWT_LSUCNT, DWT_SLEEPCNT, DWT_EXCCNT, and DWT_CPICNT are not supported." begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="NOCYCCNT" description="When set, DWT_CYCCNT is not supported." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DWT_CYCCNT" width="32" offset="0x4" internal="0" description="DWT Current PC Sampler Cycle Count Register">
    </register>
    <register id="DWT_CPICNT" width="32" offset="0x8" internal="0" description="DWT CPI Count Register">
        <bitfield id="CPICNT" description="Current CPI counter value. Increments on the additional cycles (the first cycle is not counted) required to execute all instructions except those recorded by DWT_LSUCNT. This counter also increments on all instruction fetch stalls. If CPIEVTENA is set, an event is emitted when the counter overflows. Clears to 0 on enabling." begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DWT_EXCCNT" width="32" offset="0xC" internal="0" description="DWT Exception Overhead Count Register">
        <bitfield id="EXCCNT" description="Current interrupt overhead counter value. Counts the total cycles spent in interrupt processing (for example entry stacking, return unstacking, pre-emption). An event is emitted on counter overflow (every 256 cycles). This counter initializes to 0 when enabled. Clears to 0 on enabling." begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
