Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/DWT_356.0.xml
    <register id="DWT_MASK3" width="32" offset="0x54" internal="0" description="DWT Mask Register 3">
        <bitfield id="MASK" description="Mask on data address when matching against COMP. This is the size of the ignore mask. hat is, DWT matching is performed as:(ADDR ANDed with (~0 left bit-shifted by MASK)) == COMP. However, the actual comparison is slightly more complex to enable matching an address wherever it appears on a bus. So, if COMP is 3, this matches a word access of 0, because 3 would be within the word." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DWT_FUNCTION3" width="32" offset="0x58" internal="0" description="DWT Function Register 3">
        <bitfield id="FUNCTION" description="Function settings. Note 1: If the ETM is not fitted, then ETM trigger is not possible. Note 2: Data value is only sampled for accesses that do not fault (MPU or bus fault). The PC is sampled irrespective of any faults. The PC is only sampled for the first address of a burst. Note 3: PC match is not recommended for watchpoints because it stops after the instruction. It mainly guards and triggers the ETM." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="en_0b0000" value="0x0" description="Disabled"/>
            <bitenum id="en_0b0001" value="0x1" description="EMITRANGE = 0, sample and emit PC through ITM. EMITRANGE = 1, emit address offset through ITM"/>
            <bitenum id="en_0b0010" value="0x2" description="EMITRANGE = 0, emit data through ITM on read and write. EMITRANGE = 1, emit data and address offset through ITM on read or write."/>
            <bitenum id="en_0b0011" value="0x3" description="EMITRANGE = 0, sample PC and data value through ITM on read or write. EMITRANGE = 1, emit address offset and data value through ITM on read or write."/>
            <bitenum id="en_0b0100" value="0x4" description="Watchpoint on PC match."/>
            <bitenum id="en_0b0101" value="0x5" description="Watchpoint on read."/>
            <bitenum id="en_0b0110" value="0x6" description="Watchpoint on write."/>
            <bitenum id="en_0b0111" value="0x7" description="Watchpoint on read or write."/>
            <bitenum id="en_0b1000" value="0x8" description="ETM trigger on PC match"/>
            <bitenum id="en_0b1001" value="0x9" description="ETM trigger on read"/>
            <bitenum id="en_0b1010" value="0xA" description="ETM trigger on write"/>
            <bitenum id="en_0b1011" value="0xB" description="ETM trigger on read or write"/>
            <bitenum id="en_0b1100" value="0xC" description="EMITRANGE = 0, sample data for read transfers. EMITRANGE = 1, sample Daddr [15:0] for read transfers"/>
            <bitenum id="en_0b1101" value="0xD" description="EMITRANGE = 0, sample data for write transfers. EMITRANGE = 1, sample Daddr [15:0] for write transfers"/>
            <bitenum id="en_0b1110" value="0xE" description="EMITRANGE = 0, sample PC + data for read transfers. EMITRANGE = 1, sample Daddr [15:0] + data for read transfers"/>
            <bitenum id="en_0b1111" value="0xF" description="EMITRANGE = 0, sample PC + data for write transfers. EMITRANGE = 1, sample Daddr [15:0] + data for write transfers"/>
        </bitfield>
        <bitfield id="EMITRANGE" description="Emit range field. Reserved to permit emitting offset when range match occurs. Reset clears the EMITRANGE bit. PC sampling is not supported when EMITRANGE is enabled. EMITRANGE only applies for: FUNCTION = b0001, b0010, b0011, b1100, b1101, b1110, and b1111." begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DATAVMATCH" description="This bit is only available in comparator 1. When DATAVMATCH is set, this comparator performs data value compares. The comparators given by DATAVADDR0 and DATAVADDR1provide the address for the data comparison. If DATAVMATCH is set in DWT_FUNCTION1, the FUNCTION setting for the comparators given by DATAVADDR0 and DATAVADDR1 are overridden and those comparators only provide the address match for the data comparison." begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LNK1ENA" description="" begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="en_0b0" value="0x0" description="DATAVADDR1 not supported"/>
            <bitenum id="en_0b1" value="0x1" description="DATAVADDR1 supported (enabled)."/>
        </bitfield>
        <bitfield id="DATAVSIZE" description="Defines the size of the data in the COMP register that is to be matched:" begin="11" end="10" width="2" rwaccess="R/W">
            <bitenum id="en_0b00" value="0x0" description="byte"/>
            <bitenum id="en_0b01" value="0x1" description="halfword"/>
            <bitenum id="en_0b10" value="0x2" description="word"/>
            <bitenum id="en_0b11" value="0x3" description="Unpredictable."/>
        </bitfield>
        <bitfield id="DATAVADDR0" description="Identity of a linked address comparator for data value matching when DATAVMATCH == 1." begin="15" end="12" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="DATAVADDR1" description="Identity of a second linked address comparator for data value matching when DATAVMATCH == 1 and LNK1ENA == 1." begin="19" end="16" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="MATCHED" description="This bit is set when the comparator matches, and indicates that the operation defined by FUNCTION has occurred since this bit was last read. This bit is cleared on read." begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
    </register>
</module>
